[
    {
        "text": "Yesterday I booked an auto to come back from my friend's place.\nI sat in the auto calmly, no talks, just gave OTP, my driver was driving rashly while giving hindi galiyas (bkl) and all on a call.\nI got down, gave him the amount and said Thank you.\nHe gave me a 1 star rating in front of me.\nIn the end I thought, \"Will I ever be enough?\"\nI did nothing, just sat there, scrolled Reddit.\nand here I am - Rapido what is this behaviour?\nMy customer rating has dropped :(\nWhat was my mistake? \nDid I not sit in the right angle?\nOr was he mad on me like my mom because I was out after 8.\nP.s - Satire post bolte hai issko. I have to always mention it because some people don't know about it :)",
        "engagement": 100,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Rapido",
            "Satire post"
        ]
    },
    {
        "text": "I have reviewed more than 1000 of resumes and here's what actually makes a good resume!\n🚀 Your Resume is Getting Rejected Before a Human Even Sees It - Here’s Why!\nDid you know? 75% of resumes never reach a recruiter’s eyes. They get filtered out by something scarier than your last job interview - the ATS (Applicant Tracking System).\nMost people make basic mistakes that turn their resumes into invisible job applications. If your resume isn’t getting you interviews, you might be making these career-killing mistakes ⬇️\n🔴 Fancy fonts & excessive formatting – ATS prefers simplicity. Stick to Arial, Calibri, or Times New Roman. Avoid tables, text boxes, or graphics.\n🔴 PDF or Word? – Some ATS systems struggle with docx file. When in doubt, submit a pdf file.\n🔴 Overly creative job titles – 'Chief Happiness Officer' sounds fun, but ATS won’t recognize it. Use industry-standard titles.\n🔴 Lack of keywords – ATS looks for specific skills from the job description. If you’re applying for a Data Analyst role but your resume doesn’t mention ‘SQL’ or ‘Tableau,’ say goodbye to that job. Use keywords smartly!\n🔴 Objective Statements (Nobody Cares 😅) – Replace that ‘Looking for an opportunity to grow’ fluff with a powerful summary of your achievements.\n🔴 Too much personal info – The ATS doesn’t care about your age, gender, or full address. Keep it professional.\n🔴 Your work experience is missing impact – Don’t just list responsibilities. Instead of ‘Handled social media’, write ‘Increased social media engagement by 60% in 3 months.’\n🔴 Unnecessary sections – Hobbies, declarations, personal statements? Nobody cares. Keep it clean & professional.\n🔴 Your resume is full of buzzwords – ‘Hardworking, passionate, dedicated team player’ doesn’t prove anything. Show, don’t tell!\nSo, how do you make your resume ATS-friendly & job-winning?\n✅ Use bullet points – Easier to scan, both for ATS & humans. (12-35 words)\n✅ Mirror the job description – Take important skills/keywords from the job post & weave them into your resume.\n✅ Quantify achievements – ‘Increased sales by 30%’ is stronger than ‘Handled sales.’\n✅ Use standard section headings – Stick to ‘Work Experience’ instead of ‘Journey So Far.’\n✅ File name matters – Instead of ‘Resume_Final_2(1).pdf,’ use ‘John_Doe_DataAnalyst_Resume.pdf’\n✔ Keep it simple & professional – No colors, images, charts, or fancy designs. The ATS won’t read them.\n✔ Add relevant certifications & skills – ATS ranks resumes higher if they include industry-specific skills.\nA good resume gets you an interview. \nA bad one? Doesn’t even get past the robot :)\nAll the best!",
        "engagement": 712,
        "line_count": 23,
        "language": "Hinglish",
        "tags": [
            "ATS",
            "Resume"
        ]
    },
    {
        "text": "You don’t have to have it all figured out. \nNot today. Not tomorrow. Not ever, actually.\nSome days, waking up and trying again is more than enough. \nSome days, smiling through the chaos is the real strength. \nAnd some days, just sitting in silence with yourself… \nis a conversation with God.\nThe world may measure success in numbers and noise -\nBut your soul only cares about peace.\nSo breathe. \nDrink your chai. \nCall your mom. \nLook at the sky for no reason. \nAnd remind yourself:\nYou are not behind. \nYou are not broken. \nYou are just growing in ways that can't be seen yet.\nThe universe isn’t in a rush. \nAnd neither should you be.\nSomething beautiful is blooming inside you -\neven if no one claps yet. \nEven if it’s quiet. \nEven if it’s slow.\nYou are exactly where you're meant to be.",
        "engagement": 118,
        "line_count": 13,
        "language": "Hinglish",
        "tags": [
            "motivation",
            "selfcare"
        ]
    },
    {
        "text": "I once read:\n'If you want to feel rich, just count all the things you have that money can’t buy.'\nAnd today, I did.\nA friend who checks on me randomly.\nParents who still treat me like a kid (even when I mess up).\nA sibling who’ll roast me and defend me in the same breath.\nA stranger who smiled at me today.\nThat one teacher who still remembers me.\nThe peace I feel after a long walk.\nThe excitement of starting something new.\nA playlist that never fails me.\nLaughter over inside jokes.\nAnd my own self - growing slowly, but growing.\nA warm cup of chai or coffee on a rainy day\nWatching the sunset in silence\nThat one song that feels like a hug\nUnexpected compliments from unexpected people\nLong conversations that feel like 5 minutes\nOld photos that make me smile\nThat one person who always believes in me\nThe joy of helping someone without expecting anything back.\nIf you smiled reading any of these,\nyou’re doing better than you think.\nNot everything is perfect.\nBut not everything needs to be.\nIt’s a good life.\nLet’s not forget that.",
        "engagement": 129,
        "line_count": 21,
        "language": "Hinglish",
        "tags": [
            "gratitude",
            "life"
        ]
    },
    {
        "text": "Your 9 to 5 is not your identity.\nYour job title is not your personality.\nAnd your LinkedIn headline is not your worth.\nWe live in a world where:\nSuccess is measured in CTC\nGrowth is mistaken for promotions\nAnd burnout is glorified as 'dedication'\nLeaving work on time is seen as 'lack of passion'\nTaking a break is considered 'falling behind'\nMental health is discussed only on World Mental Health Day\nLoyalty is expected, but never reciprocated\nAnd people clap louder for your job title than your character.\n14-hour shifts are called 'hustle culture'\nSaying 'no' makes you the villain\nVacations need to be justified\nCrying in the restroom is normalised\nPromotions are delayed but expectations aren’t\nConstant availability is called being 'proactive'\nYou're judged more for your LinkedIn gap than your pain\nAnd layoffs are announced in the name of 'restructuring'\nSomewhere, we forgot that:\nPeace is success\nBoundaries are healthy\nAnd life is much more than your job title\nTaking care of your mental health is also ambition.\nSpending time with family is also growth.\nBeing kind is also a flex.\nWork hard. Chase dreams.\nBut don’t forget to live in the process.\nIf you're tired of pretending everything's perfect,\nthis post is for you.",
        "engagement": 190,
        "line_count": 23,
        "language": "Hinglish",
        "tags": [
            "Burnout",
            "MentalHealth"
        ]
    },
    {
        "text": "I saw many videos and visuals of the attack in Kashmir but this video was the worst for me!\nImagine being a woman who just lost her husband and then she sees a person with a gun and gets scared that they're coming for her child.\nThe Indian Army officer had to tell her multiple times that they're here to help them and will not kill her child.\nThis feels so helpless!\nI am shook, cannot comprehend the fear.\n'Mere bache ko kuch matt karna' - she repeated that more than 3 times.\nThis is beyond sad and disturbing!\nNo one should live with this amount of fear.\nThis is not a scene from a war zone.\nThis is someone’s home.\nThis is Kashmir - yesterday.",
        "engagement": 125,
        "line_count": 9,
        "language": "Hinglish",
        "tags": [
            "indian army",
            "kashmir"
        ]
    },
    {
        "text": "Not even 100 days ago, I was lying on a hospital bed…\nTears in my eyes.\nFear in my chest.\nAnd a loud silence in my mind.\nI wasn’t recovering from surgery.\nI was recovering from something harder to explain - anxiety attacks and depression.\nNo visible scars. But inside, I was shattered.\nI was drowning in emotions I didn’t have names for.\nSome days I couldn’t get out of bed.\nSome days I avoided calls just because I couldn’t fake a smile.\nSome days I genuinely thought… maybe this pain will never leave me.\nBut the most painful part?\nFeeling like I was too much for this world.\nToo emotional. Too silent. Too sensitive. Too “difficult.”\nAnd yet - here I am today.\nTravelling. Breathing. Laughing.\nThis is my second trip in years.\nI took my first one in April - after what felt like forever.\nAnd now, I’m slowly finding myself again.\nHealing hasn’t been magical. It’s been messy.\nI still get triggered. I still get anxious.\nBut now, I know how to hold my own hand when I fall.\nAnd I owe a huge part of that to Mahadev and spirituality.\nIn moments of darkness, it was faith that kept me going.\nThe belief that this pain, too, had a purpose.\nThat I was being broken only to be rebuilt.\nThe silence of prayer.\nThe strength of surrender.\nThe reminder that I’m never truly alone.\nTo anyone out there silently struggling with anxiety or depression:\nYou are not alone.\nYou don’t have to rush your healing.\nYou don’t need to justify your sadness.\nYou are allowed to take time, to rest, to begin again.And to those who stood by me, even when I didn’t know how to ask for help -\nThank you. Your kindness saved me in ways words never can.\nPlease, be kind. Always.\nSomeone out there is fighting battles you cannot see.\nThis post is not about a trip -\nIt’s about courage.\nIt’s about survival.\nIt’s about hope.\nWith folded hands,\nThank you, Mahadev.\nThank you, life.\nI’m coming back. One breath at a time.\nJo toot kar bikhar jaaye,\nWahi toh sach mein sanwarti hai.\nWith gratitude,\nMuskan",
        "engagement": 176,
        "line_count": 34,
        "language": "Hinglish",
        "tags": [
            "depression",
            "anxiety",
            "mental health"
        ]
    },
    {
        "text": "This weekend batch is for Product Managers ready to crack the interview, not just learn the theory.\n*Couldn't do the April Batch because of some travel commitments so feel free to join me in May :)\nStarting a new cohort, 15-20 hours (4 weekends) Practical Case Studies, Resume Reviews and Mock Interviews for Product Managers.\nThis is a job-oriented batch, it's meant for people who already know the Theory and need help in breaking into the Product Role.\nAll case studies that we will be solving will be the ones asked in the Interviews before.\nThis batch will have 10 people and it will be held on weekends.\nIt'll be hands-on, with lots of case-studies, assignments, how to answer the questions, resumes improvement and mock interviews.\nCharges - INR 2700.\nIn case you're interested, please fill out the form here and I'll reach out to you via whatsapp/call -\nhttps://lnkd.in/gVU4m4Xb\nThank you!\nThe batch will start on 9th May and will have a limited number of slots! (Weekend slots :))\nIn case of any doubts feel free to reach out to me! please fill out the form and I'll reach out to you personally :)",
        "engagement": 167,
        "line_count": 9,
        "language": "Hinglish",
        "tags": [
            "Job-oriented batch",
            "Product Managers"
        ]
    },
    {
        "text": "She was on a ventilator.\nShe couldn’t speak.\nShe couldn’t move.\nShe couldn’t even scream.\nAnd that’s when he raped her.\nRight there, in the ICU.\nWhile two nurses stood and watched.\nThey did nothing.\nThis happened at one of India’s top hospitals – Medanta, Gurugram.\nA place where people go to save lives.\nNot to lose their dignity.\nThis is not just a news headline.\nThis is a terrifying reality for women in India.\nWhere even in a hospital bed, with machines keeping you alive,\nYou are not safe.\nWe talk about women empowerment.\nWe celebrate Women’s Day.\nBut what about women’s safety?\nWhat about basic human decency?\nThis is not just the failure of one person.\nThis is the failure of an entire system.\nIf two nurses can watch a woman being raped and do nothing -\nthen who's sicker: the rapist, or the system?\nSpeak up. Share. Shout.\nLet her voice be heard.\nBecause if we stay silent today,\nTomorrow it could be someone we know.\nSomeone you love.\nSomeone too helpless to scream.\nYou don’t need to be her to fight for her. You just need to be human.",
        "engagement": 188,
        "line_count": 22,
        "language": "Hinglish",
        "tags": [
            "WomenEmpowerment",
            "Scams"
        ]
    },
    {
        "text": "Subah office jaati hu guard rokta hai and bolta hai card dikhao.\nbhaiya aap mereko yeh batao, main kyu aaugi subah iss building mein kaam karne agar I am not an employee and getting paid?\nAisa unemployed hoke, kaam karne kyu aaugi main building mein jabb I'll not get paid!\nAisa bade shauk nhi hai bhaiya!\nbhaiya said - baat toh sahi hai.\nabb se hum dono dost 😌",
        "engagement": 219,
        "line_count": 6,
        "language": "Hinglish",
        "tags": [
            "shauk",
            "dost"
        ]
    },
    {
        "text": "You don’t need a million followers to be impactful.\nYou just need to be real.\nIn a world that’s obsessed with being *loud*, I hope you find the courage to be *true*.\nBecause someone is watching you heal and getting inspired to not give up. \nSomeone is learning from your calm, your patience, your kindness. \nSomeone is choosing peace over chaos because of the way you respond to things. \nSomeone is learning to believe in themselves again because you chose to rise.\nYou’re doing more than you think. \nYou’re inspiring people you don’t even know.\nSo if you ever feel like you’re behind or not doing enough -\nremember, growth is not always loud. \nSometimes, it’s silent. \nSometimes, it’s painful. \nAnd most of the time, it’s invisible.\nBut it’s happening. \nAnd that’s enough.\nKeep going. \nYou’re making a difference just by being *you*.",
        "engagement": 210,
        "line_count": 15,
        "language": "Hinglish",
        "tags": [
            "motivation",
            "inspiration"
        ]
    },
    {
        "text": "Toxic workplaces are so weird.\nI had an opportunity to work at so many internships and companies.\nSome were toxic,\nImagine fighting a 40-50 year old guy just because of office politics.\nChaache ki umar ki ho aap mere, kya ladu main aapse?\nWeird.\nZameen ki ladai laddte hai chaache se, abb aap se office mein bhi ladu?\nShakuni Mama.",
        "engagement": 291,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "office politics",
            "toxic workplaces"
        ]
    },
    {
        "text": "Yesterday I booked an auto to come back from my friend's place.\nI sat in the auto calmly, no talks, just gave OTP, my driver was driving rashly while giving hindi galiyas (bkl) and all on a call.\nI got down, gave him the amount and said Thank you.\nHe gave me a 1 star rating in front of me.\nIn the end I thought, \"Will I ever be enough?\"\nI did nothing, just sat there, scrolled Reddit.\nand here I am - Rapido what is this behaviour?\nMy customer rating has dropped :(\nWhat was my mistake? \nDid I not sit in the right angle?\nOr was he mad on me like my mom because I was out after 8.\nP.s - Satire post bolte hai issko. I have to always mention it because some people don't know about it :)",
        "engagement": 262,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Rapido",
            "Satire post"
        ]
    },
    {
        "text": "Just waiting for the day when Gen Zs normalize everything in the professional setting and we can resign by saying -\n\"Vibe match nahi ho rahi hai, bye!\"\nXOXO",
        "engagement": 243,
        "line_count": 4,
        "language": "Hinglish",
        "tags": [
            "professional setting",
            "normalization"
        ]
    },
    {
        "text": "We often underestimate the power of small wins. Sometimes, it's not about huge accomplishments, but about getting through a tough day, making a small improvement, or pushing past a challenge. These small steps add up over time. Don't wait for the big breakthrough to celebrate your progress. Every step forward matters.",
        "engagement": 340,
        "line_count": 5,
        "language": "Hinglish",
        "tags": [
            "celebrate progress",
            "small wins"
        ]
    },
    {
        "text": "It’s easy to get caught up in the rat race and constantly compare yourself to others. But true success comes when you focus on your own growth and celebrate your unique journey. Stay in your lane, and work on becoming the best version of yourself. The rest will follow.",
        "engagement": 131,
        "line_count": 4,
        "language": "Hinglish",
        "tags": [
            "success",
            "self-growth"
        ]
    },
    {
        "text": "Mentorship is one of the most valuable resources in your career. A mentor doesn’t just share advice—they help you see things from a new perspective and push you to challenge your limits. If you have a mentor, appreciate them. If you don’t, seek one out. Growth happens faster when you have someone guiding you along the way.",
        "engagement": 140,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Self Improvement",
            "Mentorship"
        ]
    },
    {
        "text": "Work-life balance isn’t a myth, but it requires boundaries and discipline. It's not about working less, but about working smarter and making time for what truly matters. Your career can thrive without sacrificing your personal life. It’s all about finding that balance that works for you.",
        "engagement": 412,
        "line_count": 4,
        "language": "Hinglish",
        "tags": [
            "productivity",
            "work-life balance"
        ]
    }
]